In [39]:
import pandas as pd

In [40]:
# Create a data frame with details of 10 students and columns as Roll Number, Name,Â Gender, Marks1, Marks2, Marks3.
dict = {
    'Roll Number': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'Name': ["Rohan", "Akash", "Rahul", "Siddharth", "Arjun","Priya", "Anjali", "Sonia", "Aisha", "Rani"],
    'Gender': ['M', 'M', 'M', 'M', 'M', 'F', 'F', 'F', 'F', 'F'],
    'Marks1': [78, 65, 89, 95, 81, 72, 68, 90, 85, 77],
    'Marks2': [82, 70, 69, 88, 75, 81, 79, 93, 82, 71],
    'Marks3': [85, 78, 92, 79, 87, 84, 80, 88, 89, 82]
}

In [41]:
df = pd.DataFrame(dict)

In [42]:
df

   Roll Number       Name Gender  Marks1  Marks2  Marks3
0            1      Rohan      M      78      82      85
1            2      Akash      M      65      70      78
2            3      Rahul      M      89      69      92
3            4  Siddharth      M      95      88      79
4            5      Arjun      M      81      75      87
5            6      Priya      F      72      81      84
6            7     Anjali      F      68      79      80
7            8      Sonia      F      90      93      88
8            9      Aisha      F      85      82      89
9           10       Rani      F      77      71      82

In [71]:
# Create a new column with total marks
df['Total Marks'] = df[['Marks1', 'Marks2', 'Marks3']].sum(axis=1) #axis=1 - columns

In [73]:
df

   Roll Number       Name Gender  Marks1  Marks2  Marks3  Total Marks
0            1      Rohan      M      78      82      85          245
1            2      Akash      M      65      70      78          213
2            3      Rahul      M      89      69      92          250
3            4  Siddharth      M      95      88      79          262
4            5      Arjun      M      81      75      87          243
5            6      Priya      F      72      81      84          237
6            7     Anjali      F      68      79      80          227
7            8      Sonia      F      90      93      88          271
8            9      Aisha      F      85      82      89          256
9           10       Rani      F      77      71      82          230

In [44]:
# Find the lowest marks in Marks1
marks1_lowest = df['Marks1'].min()

In [45]:
marks1_lowest

65

In [46]:
# Find the Highest marks in Marks2
marks2_highest = df['Marks2'].max()

In [47]:
marks2_highest

93

In [48]:
# Find the average marks in Marks3
marks3_average = df['Marks3'].mean()

In [49]:
marks3_average

84.4

In [50]:
# Find student name with highest average
highest_average_student = df.loc[df['Total Marks'].idxmax(), 'Name']

In [51]:
highest_average_student

'Sonia'

In [75]:
# Find how many students failed in Marks2 (<40)
marks2_fail = df[df['Marks2'] < 40].shape[0]

In [77]:
marks2_fail

0

In [53]:
# Create a table with the 5-number summary of all the numeric attributes
df.describe()

       Roll Number     Marks1     Marks2    Marks3  Total Marks
count     10.00000  10.000000  10.000000  10.00000     10.00000
mean       5.50000  80.000000  79.000000  84.40000    243.40000
std        3.02765   9.877022   7.888106   4.64758     17.40498
min        1.00000  65.000000  69.000000  78.00000    213.00000
25%        3.25000  73.250000  72.000000  80.50000    231.75000
50%        5.50000  79.500000  80.000000  84.50000    244.00000
75%        7.75000  88.000000  82.000000  87.75000    254.50000
max       10.00000  95.000000  93.000000  92.00000    271.00000